ru = {
    "add_employee": "Добавить сотрудника",
    "delete_employee": "Удалить сотрудника",
    "attach_employee": "Прикрепить сотрудника",
    "list_employee": "Посмотреть список сотрудников",
    "stat": "Статистика",
    "license_info": "Статус лицензии",
    "stat_employee": "Посмотреть статистику по сотруднику",
    "list_attach_employee": "Вывести общую статистику",

    # worker buttons ----------------------------------------------------------
    "measure_temp": "Измерить температуру",

    # manager buttons ---------------------------------------------------------
    "common_stat": "Вывести общую статистику",
    "ask_measure": "Запросить измерения температуры",

    # common buttons ----------------------------------------------------------
    "mistake": "Я ошибся",
    "accept": "Все верно",
    "choose_all": "Выбрать все",

    # bot to worker phrases ---------------------------------------------------
    "insert_temp": "Введите вашу температуру (например, 36.6):",
    "ask_temp": "Ваша температура {}, все верно?",
    "temp_validation": "Мне кажется, вы где-то ошиблись. Введите вашу температуру еще раз:",
    "photo_validation": "Отправьте мне фотографию градусника:",
    "reinsert_temp": "Хорошо, введите вашу температуру еще раз:",
    "accept_temp": "Отлично, теперь отправьте мне фотографию градусника.",
    "got_photo": "Проверьте вашу фотографию (например, видна ли температура).",
    "reinsert_photo": "Тогда отправьте мне фотографию еще раз:",
    "accept_photo": "Ваша температура была записана и отправлена.",
    "accept_companies": "Я записал вашу температуру.\n"
                        "Выберите компанию, в которую нужно отправить замеры:",

    # bot to manager phrases --------------------------------------------------
    "made_stats": "Вывел общую статистику по сотрудникам.",
    "asked_measure": "Запросил измерения температуры у сотрудников.",
    "choose_company_stats": "Выберите компанию, по которой нужна статистика:",
    "choose_company_measure": "Выберите компанию, в которой нужно провести замеры:",

    # common bot phrases ------------------------------------------------------
    "greeting": "Здравствуйте!",
    "missing_reply": "Извините, я вас не понял.",
    "access_error": "У вас нет доступа. Обратитесь к администратору.",
    "manager_ask_measure": "Ваш менеджер просит измерить температуру!",
    "stats_message": "Статистика была создана автоматически",
    "system_access_error": "Вас нет в системе. Обратитесь к администратору.",

    # roles -------------------------------------------------------------------
    "role_admin": "Администратор",
    "role_manager": "Менеджер",
    "role_worker": "Сотрудник",
}
