all_text = {
    # worker buttons ----------------------------------------------------------
    "measure_temp": "Измерить температуру",
    "mistake": "Назад",
    "accept": "Все верно",

    # manager buttons ---------------------------------------------------------
    "common_stat": "Вывести общую статистику",
    "ask_measure": "Запросить измерения температуры",
    "text_in_chat": "Текстом в чат",
    "file_in_chat": "Файлом в чат",
    "file_on_email": "Файлом на почту",

    # common buttons ----------------------------------------------------------
    "choose_all": "Выбрать все",
    "back": "Назад",
    "yes": "Да",
    "no": "Нет",

    # bot to worker phrases ---------------------------------------------------
    "insert_temp": "Введите вашу температуру (например, 36.6):",
    "ask_temp": "Ваша температура {}, все верно?",
    "temp_validation": "Мне кажется, вы где-то ошиблись. Введите вашу температуру еще раз:",
    "photo_validation": "Отправьте мне фотографию градусника:",
    "reinsert_temp": "Хорошо, введите вашу температуру еще раз:",
    "accept_temp": "Отлично, теперь отправьте мне фотографию градусника.",
    "got_photo": "Проверьте вашу фотографию (например, видна ли температура).",
    "reinsert_photo": "Тогда отправьте мне фотографию еще раз:",
    "accept_photo": "Ваша температура была записана и отправлена.",
    "accept_companies": "Я записал вашу температуру.\n"
                        "Выберите компанию, в которую нужно отправить замеры:",

    # bot to manager phrases --------------------------------------------------
    "made_stats": "Вывел общую статистику по сотрудникам.",
    "asked_measure": "Запросил измерения температуры у сотрудников.",
    "choose_company_stats": "Выберите компанию, по которой нужна статистика:",
    "choose_company_measure": "Выберите компанию, в которой нужно провести замеры:",
    "ask_measure_for_info": "Запросить измерения у тех, кто не померился?",
    "get_stat_type": "Как вам вывести статистику?\nВыберите опцию:",
    "choose_email": "Введите почту или выберите предыдущую:",
    "insert_email": "Введите почту:",
    "asked_measure_for_info": "Запросил измерения у тех, кто не померился.",
    "looking_for_stats": "Запрашиваю статистику.",
    "sending_stats": "Собираю статистику и отправляю ее вам на почту...",

    # common bot phrases ------------------------------------------------------
    "greeting": "Здравствуйте! Выберите опцию:",
    "missing_reply": "Извините, я вас не понял.",
    "access_error": "У вас нет доступа. Обратитесь к администратору.",
    "manager_ask_measure": "Ваш менеджер просит измерить температуру!",
    "stats_message": "Статистика была создана автоматически",
    "choose_option": "Выберите опцию:",
    "system_access_error": "Вас нет в системе. Обратитесь к администратору.",
    "server_response_error": "Связь с сервером отсутсвует, попробуйте позже.",

    # stats text --------------------------------------------------------------
    "no_employees": "У вас нет прикрепленных сотрудников.",
    "have_temp": "Измерили, есть температура:\n",
    "no_temp": "Измерили, температура отсутствует:\n",
    "no_measurement": "Не измеряли:\n",
    "last_measurement": "последнее измерение",
    "no_data": "данные отсутсвуют (нет измерений)\n",
    
    # roles -------------------------------------------------------------------
    "role_admin": "Администратор",
    "role_manager": "Менеджер",
    "role_worker": "Сотрудник",
}
